Documents/Template.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>Template</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>CustomerSegments</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Note</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>CustomerRelatonships</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Note</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Channels</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Note</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ValuePropositions</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Note</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>KeyActivities</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Note</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>KeyResources</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Note</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>KeyPartners</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Note</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>CostStructures</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Note</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>RevenueStreams</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Note</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Template/Ext/ManagerModule.bsl
Функция Печать(ДокументСсылка) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("ШаблонСтандарт");
	
	
	ОбщаяОбласть = Макет.ПолучитьОбласть("ОбщаяОбласть");
	
	ОбщаяОбласть.Параметры.СтрокаКлючевыеПартнеры 			= ПолучитьТекстПоСтрокамТЧ("KeyPartners", ДокументСсылка);
	ОбщаяОбласть.Параметры.СтрокаКлючевыеАктивности  		= ПолучитьТекстПоСтрокамТЧ("KeyActivities", ДокументСсылка);;
	ОбщаяОбласть.Параметры.СтрокаКлючевыеРесурсы      		= ПолучитьТекстПоСтрокамТЧ("KeyResources", ДокументСсылка);
	
	ОбщаяОбласть.Параметры.СтрокаЦенностныеПредложения   	= ПолучитьТекстПоСтрокамТЧ("ValuePropositions", ДокументСсылка);;
	ОбщаяОбласть.Параметры.СтрокаВзаимоотношенияСКлиентами  = ПолучитьТекстПоСтрокамТЧ("CustomerRelatonships", ДокументСсылка);;
	ОбщаяОбласть.Параметры.СтрокаКаналыСбыта                = ПолучитьТекстПоСтрокамТЧ("Channels", ДокументСсылка);;
	
	ОбщаяОбласть.Параметры.СтрокаПотребительскиеСегменты   	= ПолучитьТекстПоСтрокамТЧ("CustomerSegments", ДокументСсылка);;
	ОбщаяОбласть.Параметры.СтрокаСтруктураИздержек          = ПолучитьТекстПоСтрокамТЧ("CostStructures", ДокументСсылка);;
	ОбщаяОбласть.Параметры.СтрокаПотокиПоступленияДоходов   = ПолучитьТекстПоСтрокамТЧ("RevenueStreams", ДокументСсылка);;
	
	ОбщаяОбласть.Параметры.Дата 	= Формат(ДокументСсылка.Дата,"ДФ=dd.MM.yyyy");
	ОбщаяОбласть.Параметры.Проект 	= ДокументСсылка.Проект; 
	ТабДок.Вывести(ОбщаяОбласть);
	
	Возврат ТабДок;
	
КонецФункции

Функция ПолучитьТекстПоСтрокамТЧ(ИмяТЧ, ДокументСсылка)
	
	ТекстЯчейки = "";
	Для Каждого Стр Из ДокументСсылка[ИмяТЧ] Цикл
		ТекстЯчейки = ТекстЯчейки + Стр.Note + Символы.ПС; 	
	КонецЦикла; 
	
	Возврат ТекстЯчейки;
	
КонецФункции
